[
  { "m": "Nice to have you here! How are you doing?"},
  { "m": "Looking for some new technology to learn in your spare time?"},
  { "m": "Your boss tasked you with this brand new project he's no idea how to carry out?"},
  { "m": "Well, sometimes the amount of different technologies seems overwhelming. Too many choices is no choice at all."},
  { "q": "Don't worry, we can do this. Let's start by defining our scope here. What do you want to talk about?", "answers": [
      {"intent": "SwitchTopic", "entities": ["MachineLearning"], "next": "StartMachineLearning"},
      {"intent": "SwitchTopic", "entities": ["MobileApp"], "next": "StartMobileApp"}
    ]
  },
  { "label": "NewTopic", "m": "Do you want to speak about something else?"},
  { "label": "HandleInjury", "messages": [
    "Does your mom know you talk this way with strangers?"
  ]},
  { "q": "This time I will let it slide. What were we talking about?", "answers": [
      {"intent": "SwitchTopic", "entities": ["MachineLearning"], "next": "StartMachineLearning"},
      {"intent": "SwitchTopic", "entities": ["MobileApp"], "next": "StartMobileApp"}
    ]},
  { "label": "StartMachineLearning", "m": "Great, I'm passionate about machine learning! Pretty hot topic these days, ha?"},
  { "m": "First things first. Machine learning is about data"},
  { "q": "What kind of data are you going to work with?", "answers": [
      {"choice": "Text", "next": "MLText"},
      {"choice": "Image", "next": "MLImage"},
      {"choice": "Sound", "next": "MLSound"},
      {"intent": "Dunno", "next": "MLGeneric"}
    ]},
  { "label": "MLText", "m": "2016 has been the year of conversational. Conversational everything."},
  { "m": "Even this website is conversational! Big surprise,ha?"},
  { "m": "It's actually pretty simple to develop. Some smart folks developed good APIs to support the chat bot."},
  { "q": "What now?", "answers": []},
  { "label": "MLImage", "m": "Then, best choice is probably to apply deep neural network. More commonly known as deep learning."},
  { "m": "Models based on convolutional neural networks are all around the state of the art for extracting features from images."},
  { "q": "Have you a general knowledge about neural networks?", "answers": [
    {"choice": "Yes", "next": "MLImageYes"},
    {"choice": "No", "next": "MLImageNo"}
  ]},
  { "label": "MLImageYes", "m": "I recommend to start with Caffe. It's particularly suited for images and has a friendly Python interface."},
  { "m": "Moreover, there is this wonderful Model Zoo with pretrained models. Just feed them with your data and have fun!"},
  { "label": "MLImageNo", "m": "Huum.. maybe you can start from this hands-on tutorial. It uses Python (have I already said you should learn Python?)"},
  { "m": "If you don't want to get your hands dirty, there are wonderful API out there!"},
  { "label": "StartMobileApp", "m": "Cool! I suppose you already have prototyped the User Experience, right?"}

]
